{
    "diagrams": [
        {
            "id": "048",
            "topic": "Data Science",
            "category": "Computer Science",
            "description": "Data Science encompasses methodologies, tools, and applications for comprehensive data analysis and insight generation. Core competencies include statistics providing hypothesis testing, probability distributions, and inferential methods, programming using Python and R for data manipulation and analysis, machine learning applying supervised and unsupervised algorithms, data visualization creating compelling graphics with Tableau and matplotlib, and domain expertise understanding business context. Data types span structured data in relational databases, semi-structured data like JSON and XML, unstructured data including text and images, time series with temporal patterns, and streaming data requiring real-time processing. Analytical techniques employ descriptive analytics summarizing historical data, diagnostic analytics explaining why events occurred, predictive analytics forecasting future outcomes, prescriptive analytics recommending optimal actions, and causal inference establishing cause-effect relationships. Tools and technologies utilize Python with pandas and scikit-learn, R for statistical computing, SQL for database queries, big data frameworks like Spark and Hadoop, and cloud platforms including AWS and Azure. Applications include customer analytics for segmentation and churn prediction, financial analytics for fraud detection and risk modeling, healthcare analytics for patient outcomes and drug discovery, and operations analytics optimizing supply chains and processes.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Data<br>Science</b>))\n    <b>Core Competencies</b>\n      Statistics\n      Programming\n      Machine learning\n      Data visualization\n      Domain expertise\n      Communication skills\n    <b>Data Types</b>\n      Structured data\n      Semi-structured data\n      Unstructured data\n      Time series\n      Streaming data\n      Spatial data\n    <b>Analytical Techniques</b>\n      Descriptive analytics\n      Diagnostic analytics\n      Predictive analytics\n      Prescriptive analytics\n      Causal inference\n    <b>Tools & Technologies</b>\n      Python pandas\n      R statistical computing\n      SQL databases\n      Spark & Hadoop\n      Cloud platforms\n      Jupyter notebooks\n    <b>Visualization Tools</b>\n      Tableau\n      Power BI\n      Matplotlib\n      Seaborn\n      D3.js\n      Plotly\n    <b>Applications</b>\n      Customer analytics\n      Financial analytics\n      Healthcare analytics\n      Operations optimization\n      Marketing intelligence\n    <b>Big Data</b>\n      Distributed computing\n      Data lakes\n      NoSQL databases\n      Data warehousing\n      ETL pipelines\n    <b>Ethics & Governance</b>\n      Data privacy\n      Algorithmic fairness\n      Transparency\n      Responsible AI\n      Data quality",
            "complexity": "high",
            "tags": [
                "data_science",
                "computer_science"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}