{
    "diagrams": [
        {
            "id": "049",
            "topic": "Computer Security",
            "category": "Computer Science",
            "description": "Computer Security encompasses threat categories, defensive mechanisms, and security frameworks protecting digital assets. Security principles include confidentiality preventing unauthorized information disclosure, integrity ensuring data accuracy and trustworthiness, availability maintaining system accessibility, authentication verifying identity claims, and non-repudiation proving actions occurred. Threat categories span malware including viruses, trojans, and ransomware, social engineering manipulating human psychology, network attacks exploiting protocol vulnerabilities, insider threats from authorized users, and advanced persistent threats conducting sophisticated campaigns. Security controls employ preventive controls blocking threats before occurrence, detective controls identifying security events, corrective controls responding to incidents, and deterrent controls discouraging attacks. Cryptography provides symmetric encryption for confidentiality, asymmetric encryption for key exchange, hash functions for integrity verification, digital signatures for authentication, and public key infrastructure for certificate management. Network security implements firewalls filtering traffic, VPNs securing remote access, intrusion prevention systems blocking attacks, network segmentation limiting breach scope, and secure protocols like TLS. Application security addresses secure coding practices, input validation, authentication mechanisms, session management, and security testing throughout development lifecycle.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((Computer Security))\n    Cryptography\n      Encryption\n      Hashing\n      Digital Signatures\n      Public Key Infrastructure\n    Network Security\n      Firewalls\n      IDS/IPS\n      VPN\n      Network Protocols\n    Application Security\n      Secure Coding\n      Input Validation\n      Authentication\n      Authorization\n    Threat Analysis\n      Malware\n      Phishing\n      Social Engineering\n      Zero-day Exploits\n    Security Operations\n      Monitoring\n      Incident Response\n      Forensics\n      Patch Management\n    Access Control\n      Identity Management\n      Multi-factor Authentication\n      Role-based Access\n    Compliance\n      Regulations\n      Standards\n      Auditing\n      Risk Management",
            "complexity": "high",
            "tags": [
                "computer_security",
                "computer_science"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}

