{
    "diagrams": [
        {
            "id": "051",
            "topic": "Databases",
            "category": "Computer Science",
            "description": "Databases encompass models, management systems, and optimization techniques for efficient data organization. Database models include relational using tables and SQL, NoSQL offering flexible schemas with document, key-value, column-family, and graph databases, object-oriented storing objects directly, and hierarchical organizing tree structures. RDBMS systems feature Oracle for enterprise applications, MySQL for web applications, PostgreSQL for advanced features, SQL Server for Microsoft ecosystems, and SQLite for embedded databases. NoSQL databases employ MongoDB for document storage, Cassandra for distributed wide-column, Redis for in-memory key-value, Neo4j for graph relationships, and Elasticsearch for full-text search. Database operations utilize SQL for querying with SELECT statements, data manipulation via INSERT/UPDATE/DELETE, data definition through CREATE/ALTER/DROP, and data control managing permissions. Normalization forms include first normal form eliminating repeating groups, second normal form removing partial dependencies, third normal form eliminating transitive dependencies, and Boyce-Codd normal form addressing anomalies. Performance optimization employs indexing for fast lookups, query optimization improving execution plans, partitioning dividing large tables, caching reducing database hits, and connection pooling managing database connections efficiently.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Databases</b>))\n    <b>Database Models</b>\n      Relational tables\n      NoSQL flexible\n      Object-oriented\n      Hierarchical\n      Network model\n    <b>RDBMS Systems</b>\n      Oracle\n      MySQL\n      PostgreSQL\n      SQL Server\n      SQLite\n    <b>NoSQL Databases</b>\n      MongoDB documents\n      Cassandra wide-column\n      Redis key-value\n      Neo4j graph\n      Elasticsearch search\n    <b>SQL Operations</b>\n      SELECT queries\n      INSERT/UPDATE/DELETE\n      CREATE/ALTER/DROP\n      JOIN operations\n      Aggregate functions\n    <b>Normalization Forms</b>\n      First normal form\n      Second normal form\n      Third normal form\n      Boyce-Codd NF\n      Denormalization\n    <b>Performance Optimization</b>\n      Indexing strategies\n      Query optimization\n      Table partitioning\n      Caching layers\n      Connection pooling\n    <b>ACID Properties</b>\n      Atomicity\n      Consistency\n      Isolation\n      Durability\n      Transaction control\n    <b>Data Integrity</b>\n      Primary keys\n      Foreign keys\n      Constraints\n      Triggers\n      Validation rules\n    <b>Scaling Strategies</b>\n      Vertical scaling\n      Horizontal scaling\n      Replication\n      Sharding\n      Load balancing",
            "complexity": "high",
            "tags": [
                "databases",
                "computer_science"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}