{
    "diagrams": [
        {
            "id": "066",
            "topic": "Materials Engineering",
            "category": "Engineering",
            "description": "Materials Engineering encompasses diverse material types and applications. Metals include ferrous alloys (steel, cast iron, stainless steel), non-ferrous alloys (aluminum, titanium, copper, magnesium), and superalloys for high-temperature applications. Ceramics span traditional ceramics (clay, porcelain), advanced ceramics (alumina, silicon carbide, zirconia), and glass materials. Polymers include thermoplastics (polyethylene, polypropylene, PVC, nylon), thermosets (epoxy, polyester), and elastomers (rubber). Composite materials feature fiber-reinforced composites (carbon fiber, glass fiber), metal matrix composites, and ceramic matrix composites. Processing techniques involve casting, forging, rolling, extrusion, powder metallurgy, additive manufacturing, and thin film deposition. Characterization tools include SEM, TEM, XRD, XPS, AFM, and various mechanical testing methods (tensile, hardness, fatigue, fracture toughness). Properties of interest span mechanical (strength, ductility, toughness), thermal (conductivity, expansion), electrical (conductivity, resistivity), and chemical (corrosion resistance). Applications cover aerospace structures, automotive components, electronic devices, energy systems, biomedical implants, and construction materials.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Materials<br>Engineering</b>))\n    <b>Metals</b>\n      Ferrous Alloys\n        Steel\n        Cast Iron\n        Stainless Steel\n      Non-ferrous\n        Aluminum\n        Titanium\n        Copper\n        Magnesium\n      Superalloys\n    <b>Ceramics</b>\n      Traditional\n        Clay\n        Porcelain\n      Advanced\n        Alumina\n        Silicon Carbide\n        Zirconia\n      Glass\n    <b>Polymers</b>\n      Thermoplastics\n        Polyethylene\n        Polypropylene\n        PVC\n        Nylon\n      Thermosets\n        Epoxy\n        Polyester\n      Elastomers\n    <b>Composites</b>\n      Fiber-reinforced\n        Carbon Fiber\n        Glass Fiber\n      Metal Matrix\n      Ceramic Matrix\n    <b>Processing Techniques</b>\n      Casting\n      Forging\n      Rolling\n      Extrusion\n      Powder Metallurgy\n      Additive Manufacturing\n      Thin Film Deposition\n    <b>Characterization Tools</b>\n      SEM\n      TEM\n      XRD\n      XPS\n      AFM\n      Mechanical Testing\n    <b>Properties</b>\n      Mechanical\n        Strength\n        Ductility\n        Toughness\n      Thermal\n      Electrical\n      Chemical\n    <b>Applications</b>\n      Aerospace\n      Automotive\n      Electronics\n      Energy Systems\n      Biomedical\n      Construction",
            "complexity": "high",
            "tags": [
                "materials_engineering",
                "engineering"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}