{
    "diagrams": [
        {
            "id": "067",
            "topic": "Nuclear Engineering",
            "category": "Engineering",
            "description": "Nuclear Engineering encompasses diverse reactor types and applications. Reactor technologies include pressurized water reactors (PWR), boiling water reactors (BWR), pressurized heavy water reactors (PHWR/CANDU), fast breeder reactors, high-temperature gas reactors, and advanced designs (small modular reactors, molten salt reactors, fusion reactors under development). The fuel cycle involves uranium mining, conversion, enrichment, fuel fabrication, reactor operation, spent fuel storage, reprocessing, and final waste disposal. Radiation detection uses Geiger counters, scintillation detectors, semiconductor detectors, and dosimeters. Nuclear materials include fissile materials (U-235, Pu-239), fertile materials (U-238, Th-232), moderators (water, heavy water, graphite), coolants, and control materials (boron, cadmium). Medical applications span PET scans, SPECT imaging, radiation therapy (external beam, brachytherapy), and radiopharmaceuticals. Safety systems feature containment structures, emergency core cooling, redundant safety systems, and passive safety features. Computational tools include MCNP, RELAP, SCALE, and reactor simulation codes. Regulatory frameworks involve NRC licensing, IAEA standards, and international safety protocols.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Nuclear<br>Engineering</b>))\n    <b>Reactor Types</b>\n      PWR\n      BWR\n      PHWR/CANDU\n      Fast Breeder\n      High-temp Gas\n      Advanced Designs\n        SMRs\n        Molten Salt\n        Fusion (development)\n    <b>Fuel Cycle</b>\n      Mining\n      Conversion\n      Enrichment\n      Fuel Fabrication\n      Reactor Operation\n      Spent Fuel Storage\n      Reprocessing\n      Waste Disposal\n    <b>Radiation Detection</b>\n      Geiger Counters\n      Scintillation Detectors\n      Semiconductor Detectors\n      Dosimeters\n    <b>Nuclear Materials</b>\n      Fissile\n        U-235\n        Pu-239\n      Fertile\n        U-238\n        Th-232\n      Moderators\n        Water\n        Heavy Water\n        Graphite\n      Coolants\n      Control Materials\n    <b>Medical Applications</b>\n      PET Scans\n      SPECT Imaging\n      Radiation Therapy\n        External Beam\n        Brachytherapy\n      Radiopharmaceuticals\n    <b>Safety Systems</b>\n      Containment\n      Emergency Cooling\n      Redundant Systems\n      Passive Safety\n    <b>Computational Tools</b>\n      MCNP\n      RELAP\n      SCALE\n      Simulation Codes\n    <b>Regulatory</b>\n      NRC Licensing\n      IAEA Standards\n      Safety Protocols",
            "complexity": "high",
            "tags": [
                "nuclear_engineering",
                "engineering"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}