{
    "diagrams": [
        {
            "id": "089",
            "topic": "Acoustic Engineering",
            "category": "Engineering",
            "description": "Acoustics Engineering encompasses physical principles, measurement techniques, design approaches, and applications controlling sound in diverse environments. Acoustic fundamentals include sound waves as pressure variations, frequency determining pitch, wavelength affecting diffraction, amplitude relating to loudness, phase governing interference, and speed varying with medium properties. Room acoustics parameters feature reverberation time measuring decay duration, early decay time indicating initial reflections, clarity index quantifying speech intelligibility, definition separating direct from reverberant sound, and sound strength measuring loudness. Noise control methods employ source modification reducing emissions, path treatment using barriers and enclosures, absorption materials dissipating energy, vibration isolation preventing structural transmission, and active noise cancellation using destructive interference. Acoustic materials include porous absorbers like fiberglass and foam, panel absorbers using membrane resonance, resonant absorbers targeting specific frequencies, diffusers scattering reflections uniformly, and reflectors directing sound strategically. Applications span architectural acoustics for concert halls and theaters, environmental noise controlling transportation and industrial sources, underwater acoustics for sonar and marine communication, musical acoustics understanding instruments and performance spaces, psychoacoustics studying perception and cognition, and ultrasound using high-frequency applications. Measurement techniques utilize sound level meters quantifying intensity, frequency analyzers revealing spectral content, impulse response measuring room characteristics, sound intensity probes determining directionality, and acoustic holography mapping sound fields.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Acoustics<br>Engineering</b>))\n    <b>Acoustic Fundamentals</b>\n      Sound wave propagation\n      Frequency & pitch\n      Wavelength & diffraction\n      Amplitude & loudness\n      Phase & interference\n      Speed in media\n    <b>Room Acoustics</b>\n      Reverberation time RT60\n      Early decay time\n      Clarity index\n      Definition metric\n      Sound strength\n      Bass ratio\n    <b>Noise Control Methods</b>\n      Source modification\n      Barrier & enclosure\n      Absorption materials\n      Vibration isolation\n      Active noise cancellation\n      Damping treatments\n    <b>Acoustic Materials</b>\n      Porous absorbers\n      Panel absorbers\n      Resonant absorbers\n      Diffusers scattering\n      Reflectors directing\n      Isolation materials\n    <b>Applications</b>\n      Architectural acoustics\n      Environmental noise\n      Underwater acoustics\n      Musical acoustics\n      Psychoacoustics\n      Ultrasound applications\n    <b>Measurement Techniques</b>\n      Sound level meters\n      Frequency analyzers\n      Impulse response\n      Sound intensity probes\n      Acoustic holography\n      Transmission loss\n    <b>Design Criteria</b>\n      Speech intelligibility\n      Music clarity\n      Background noise\n      Privacy ratings\n      Sound isolation\n    <b>Electroacoustics</b>\n      Microphone technologies\n      Loudspeaker design\n      Audio amplification\n      Signal processing\n      Sound reinforcement",
            "complexity": "high",
            "tags": [
                "acoustic_engineering",
                "engineering"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}