{
    "diagrams": [
        {
            "id": "091",
            "topic": "Petroleum Engineering",
            "category": "Engineering",
            "description": "Petroleum Engineering encompasses exploration methods, drilling technologies, production techniques, and recovery strategies extracting hydrocarbon resources efficiently and safely. Exploration techniques include seismic surveying using reflected waves imaging subsurface structures, gravity and magnetic surveys detecting density variations, well logging measuring formation properties, core analysis examining rock samples, and geological modeling integrating data. Drilling technologies feature rotary drilling using rotating drill bits, directional drilling reaching offset targets, horizontal drilling maximizing reservoir contact, underbalanced drilling preventing formation damage, and managed pressure drilling controlling wellbore pressure precisely. Well completion methods employ cased-hole completions with cemented casing, open-hole completions exposing formation directly, gravel packs controlling sand production, hydraulic fracturing creating flow paths, and multilateral wells accessing multiple zones. Production systems utilize natural flow exploiting reservoir pressure, gas lift injecting gas reducing fluid density, electrical submersible pumps for high-volume lifting, sucker rod pumps for beam pumping, and progressive cavity pumps handling viscous fluids. Enhanced oil recovery techniques include waterflooding maintaining pressure, CO2 injection miscible displacement, thermal recovery heating heavy oil, chemical flooding altering fluid properties, and microbial enhanced recovery using bacteria. Reservoir engineering analyzes material balance tracking fluids, decline curve analysis forecasting production, well testing measuring properties, and pressure transient analysis characterizing reservoirs. Challenges address unconventional resources requiring advanced stimulation, deepwater drilling managing high pressures, heavy oil requiring thermal methods, and environmental concerns including methane emissions and water management.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Petroleum<br>Engineering</b>))\n    <b>Exploration Techniques</b>\n      Seismic surveying\n      Gravity & magnetic surveys\n      Well logging\n      Core analysis\n      Geological modeling\n      Geostatistics\n    <b>Drilling Technologies</b>\n      Rotary drilling\n      Directional drilling\n      Horizontal drilling\n      Underbalanced drilling\n      Managed pressure drilling\n      Automated drilling\n    <b>Well Completion</b>\n      Cased-hole completions\n      Open-hole completions\n      Gravel packs\n      Hydraulic fracturing\n      Multilateral wells\n      Smart completions\n    <b>Production Systems</b>\n      Natural flow\n      Gas lift injection\n      ESP pumps\n      Sucker rod pumps\n      Progressive cavity pumps\n      Jet pumps\n    <b>Enhanced Oil Recovery</b>\n      Waterflooding\n      CO2 injection\n      Thermal recovery\n      Chemical flooding\n      Microbial EOR\n      Polymer flooding\n    <b>Reservoir Engineering</b>\n      Material balance\n      Decline curve analysis\n      Well testing\n      Pressure transient\n      Reservoir simulation\n      Production forecasting\n    <b>Facilities</b>\n      Separation equipment\n      Gas processing\n      Water treatment\n      Pipeline systems\n      Storage tanks\n      Compression stations\n    <b>Challenges</b>\n      Unconventional resources\n      Deepwater drilling\n      Heavy oil recovery\n      Environmental concerns\n      Water management\n      Methane emissions",
            "complexity": "high",
            "tags": [
                "petroleum_engineering",
                "engineering"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}