{
    "diagrams": [
        {
            "id": "094",
            "topic": "Surveying",
            "category": "Engineering",
            "description": "Surveying encompasses measurement techniques, instruments, applications, and computational methods precisely determining positions and creating spatial data. Survey types include boundary surveys establishing property limits, topographic surveys mapping terrain features, construction surveys guiding building projects, geodetic surveys determining Earth's shape, hydrographic surveys mapping underwater features, and cadastral surveys for land registration. Instruments and technologies feature total stations integrating electronic distance measurement and angle measurement, GPS/GNSS receivers determining positions via satellite constellations, levels measuring elevation differences, theodolites measuring horizontal and vertical angles, laser scanners capturing millions of 3D points, and drones conducting aerial surveys. Measurement methods employ traversing connecting points sequentially, triangulation forming triangular networks, trilateration using distance measurements, leveling determining height differences, GPS positioning using satellite signals, and photogrammetry extracting measurements from photographs. Coordinate systems utilize state plane coordinates for regional mapping, UTM (Universal Transverse Mercator) for global applications, geographic coordinates with latitude and longitude, local coordinate systems for projects, and vertical datums for elevations. Applications span land development planning subdivisions, infrastructure projects for roads and utilities, mining operations surveying excavations, environmental monitoring tracking changes, legal boundary disputes resolving conflicts, and as-built surveys documenting completed construction. Computational methods include least squares adjustment minimizing errors, coordinate transformations converting between systems, error propagation analyzing uncertainty, and area and volume calculations for earthwork.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Surveying</b>))\n    <b>Survey Types</b>\n      Boundary surveys limits\n      Topographic terrain mapping\n      Construction project guidance\n      Geodetic Earth shape\n      Hydrographic underwater\n      Cadastral land registration\n    <b>Instruments</b>\n      Total stations EDM\n      GPS/GNSS satellites\n      Levels elevation\n      Theodolites angles\n      Laser scanners 3D points\n      Drones aerial surveys\n    <b>Measurement Methods</b>\n      Traversing sequential\n      Triangulation networks\n      Trilateration distances\n      Leveling heights\n      GPS positioning\n      Photogrammetry photos\n    <b>Coordinate Systems</b>\n      State plane regional\n      UTM global applications\n      Geographic lat/long\n      Local project systems\n      Vertical datums elevations\n      Geoid models\n    <b>Applications</b>\n      Land development planning\n      Infrastructure roads utilities\n      Mining operations excavations\n      Environmental monitoring\n      Legal boundary disputes\n      As-built documentation\n    <b>Computational Methods</b>\n      Least squares adjustment\n      Coordinate transformations\n      Error propagation\n      Area & volume calculations\n      Curve geometry\n    <b>Legal Aspects</b>\n      Property descriptions\n      Easements & rights\n      Boundary monuments\n      Title research\n      Expert testimony\n    <b>Standards</b>\n      Accuracy specifications\n      Professional licensing\n      Survey plats requirements\n      Control survey standards\n      Quality control protocols",
            "complexity": "high",
            "tags": [
                "surveying",
                "engineering"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}