{
    "diagrams": [
        {
            "id": "095",
            "topic": "Cartography",
            "category": "Engineering",
            "description": "Cartography encompasses map types, design principles, projection systems, and technologies creating effective spatial representations for diverse purposes. Map types include topographic maps showing terrain and features, thematic maps visualizing specific data patterns, nautical charts for marine navigation, aeronautical charts for aviation, cadastral maps depicting property boundaries, and statistical maps representing demographic or economic data. Map projections transform Earth's curved surface to flat representations including Mercator preserving angles, Transverse Mercator for narrow zones, Lambert Conformal Conic for mid-latitudes, Albers Equal Area preserving areas, and Robinson compromise projections balancing distortions. Design principles apply visual hierarchy emphasizing important features, color schemes conveying meaning and relationships, typography selecting appropriate fonts and sizes, symbolization creating intuitive feature representations, and composition balancing elements harmoniously. Cartographic generalization employs selection choosing relevant features, simplification reducing detail, smoothing removing irregularities, aggregation combining features, and displacement separating overlapping elements. Scale considerations range from large-scale detailed local maps to small-scale regional or world maps affecting feature representation. Digital cartography technologies utilize Geographic Information Systems managing spatial data, remote sensing providing imagery, web mapping serving interactive maps, 3D visualization creating terrain models, and mobile mapping enabling location-based services. Production methods include traditional lithography, digital printing, web tile services, and vector rendering. Applications span navigation guiding travelers, urban planning informing development, environmental monitoring tracking changes, military operations supporting tactics, and education teaching geography.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Cartography</b>))\n    <b>Map Types</b>\n      Topographic terrain\n      Thematic data patterns\n      Nautical marine charts\n      Aeronautical aviation\n      Cadastral property\n      Statistical demographics\n    <b>Map Projections</b>\n      Mercator angle preservation\n      Transverse Mercator zones\n      Lambert Conformal mid-lat\n      Albers Equal Area\n      Robinson compromise\n      Web Mercator online\n    <b>Design Principles</b>\n      Visual hierarchy emphasis\n      Color schemes meaning\n      Typography fonts sizes\n      Symbolization intuitive\n      Composition balance\n      Figure-ground contrast\n    <b>Generalization</b>\n      Selection relevance\n      Simplification detail reduction\n      Smoothing irregularities\n      Aggregation combining\n      Displacement separation\n      Exaggeration emphasis\n    <b>Scale Considerations</b>\n      Large-scale local detail\n      Medium-scale regional\n      Small-scale world overview\n      Scale representation\n      Level of detail\n    <b>Digital Technologies</b>\n      GIS spatial data\n      Remote sensing imagery\n      Web mapping interactive\n      3D visualization terrain\n      Mobile location services\n      Cloud tile servers\n    <b>Symbolization</b>\n      Point symbols locations\n      Line symbols linear features\n      Area symbols regions\n      Pictorial icons\n      Graduated symbols quantitative\n      Choropleth shading\n    <b>Applications</b>\n      Navigation guidance\n      Urban planning development\n      Environmental monitoring\n      Military operations\n      Education geography\n      Emergency response",
            "complexity": "high",
            "tags": [
                "cartography",
                "engineering"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}