{
    "diagrams": [
        {
            "id": "295",
            "topic": "Waste Management",
            "category": "Environmental Sciences",
            "description": "Waste management history traces to ancient civilizations where waste disposal in dumps and open burning were common practices, with some cities like Athens establishing primitive waste collection. The Middle Ages saw waste accumulation in streets contributing to disease outbreaks. The 19th century brought sanitation reforms during the Industrial Revolution, with the first organized waste collection services in major cities and early incinerators developed. The early 1900s introduced systematic municipal waste collection, the first sanitary landfill (Fresno, California, 1937), and early recycling efforts during World Wars (material conservation). The 1960s marked growing environmental awareness with concerns about pollution from open dumps and uncontrolled burning. The 1970s brought landmark legislation including the Resource Conservation and Recovery Act (RCRA, 1976) in the U.S., establishing hazardous waste regulations and modern landfill standards. The 1980s saw recycling programs expansion, the waste hierarchy concept formalization, and waste-to-energy facility development. The 1990s introduced extended producer responsibility (EPR) policies, single-stream recycling systems, and sustainable waste management concepts. The 2000s advanced with zero waste initiatives, circular economy principles, improved sorting technologies (optical sensors), and organic waste diversion programs. The 2010s-2020s continue with plastic waste crisis recognition, China's National Sword policy (2018) disrupting global recycling, microplastics concerns, chemical recycling technologies, waste-to-hydrogen systems, AI-powered sorting robots, and circular economy transition becoming global priorities.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title <b>Waste Management Evolution</b>\n    \n    section Ancient to Industrial\n        Ancient Times : Open dumps & burning\n                      : Primitive collection\n        Middle Ages : Street waste accumulation\n                    : Disease outbreaks\n        1800s : Sanitation reforms\n              : Industrial Revolution\n              : First organized collection\n              : Early incinerators\n    \n    section Systematic Management\n        Early 1900s : Municipal collection systems\n                    : First sanitary landfill (1937)\n                    : WWI & WWII recycling\n        1960s : Environmental concerns\n              : Pollution from open dumps\n    \n    section Regulatory Era\n        1976  : RCRA enacted\n              : Hazardous waste regulations\n              : Modern landfill standards\n        1980s : Recycling programs expand\n              : Waste hierarchy formalized\n              : Waste-to-energy facilities\n    \n    section Sustainable Approaches\n        1990s : EPR policies introduced\n              : Single-stream recycling\n              : Sustainable concepts\n        2000s : Zero waste initiatives\n              : Circular economy principles\n              : Improved sorting tech\n              : Organic waste diversion\n    \n    section Global Challenges\n        2010s-2020s : Plastic waste crisis\n                    : China National Sword (2018)\n                    : Microplastics concerns\n                    : Chemical recycling\n                    : Waste-to-hydrogen\n                    : AI-powered sorting\n                    : Circular transition",
            "complexity": "high",
            "tags": [
                "waste_management",
                "environmental_sciences"
            ],
            "creation_date": "2025-01-27"
        }
    ]
}