{
    "diagrams": [
        {
            "id": "303",
            "topic": "Structural Geology",
            "category": "Earth Sciences",
            "description": "Structural geology emerged in the 18th-19th centuries with early geological observations and the recognition that rocks could be deformed. James Hutton (late 1700s) recognized unconformities and deep time, laying groundwork for understanding geological processes. The 1800s brought systematic geological mapping in Europe, recognition of folds and faults, and development of structural terminology. 1815 saw William Smith's geological map of England demonstrating structure's importance. The late 1800s introduced concepts of nappes and overthrusts in the Alps (Marcel Bertrand, Albert Heim), challenging previous understanding of deformation magnitude. The early 1900s brought E.M. Anderson's theory of faulting (1905, published 1951) relating fault types to stress orientations, and development of structural analysis techniques. The 1920s-30s saw Hans Cloos's experimental tectonics and introduction of kinematic analysis. The 1960s revolutionized the field with plate tectonics theory explaining global deformation patterns, transform faults recognition, and Wilson cycle concepts. The 1970s-80s advanced with microstructural analysis development, quantitative structural geology emergence, balanced cross-section techniques, and experimental rock deformation in laboratories. The 1990s brought computer-aided structural analysis, 3D geological modeling software, and GPS for measuring active deformation. The 2000s-2010s advanced with InSAR for surface deformation monitoring, 4D structural evolution modeling, integration with seismic data (especially in petroleum industry), and digital field data collection. The 2020s continue with machine learning for structural pattern recognition, LiDAR and photogrammetry for outcrop analysis, real-time earthquake monitoring and structural analysis, virtual outcrop models, and integration of structural geology with geodynamic modeling revealing Earth's tectonic evolution.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title <b>Structural Geology Evolution</b>\n    \n    section Early Foundations\n        Late 1700s : James Hutton\n                   : Unconformities recognized\n                   : Deep time concept\n        1800s : Systematic geological mapping\n              : Folds & faults recognized\n              : Structural terminology\n        1815  : William Smith's map\n              : England geology\n    \n    section Alps Revolution\n        Late 1800s : Nappes & overthrusts\n                   : Alps studies\n                   : Bertrand, Heim\n                   : Deformation magnitude\n    \n    section Theoretical Foundations\n        1905  : Anderson's faulting theory\n              : Stress orientations\n        1920s-30s : Hans Cloos experiments\n                  : Kinematic analysis\n    \n    section Plate Tectonics Era\n        1960s : Plate tectonics theory\n              : Global deformation patterns\n              : Transform faults\n              : Wilson cycle\n        1970s-80s : Microstructural analysis\n                  : Quantitative methods\n                  : Balanced cross-sections\n                  : Laboratory experiments\n    \n    section Digital Revolution\n        1990s : Computer-aided analysis\n              : 3D geological modeling\n              : GPS measurements\n        2000s-2010s : InSAR monitoring\n                    : 4D evolution modeling\n                    : Seismic integration\n                    : Digital field collection\n    \n    section Modern Era\n        2020s : Machine learning applications\n              : LiDAR & photogrammetry\n              : Real-time monitoring\n              : Virtual outcrop models\n              : Geodynamic integration",
            "complexity": "high",
            "tags": [
                "structural_geology",
                "earth_sciences"
            ],
            "creation_date": "2025-01-27"
        }
    ]
}