{
    "diagrams": [
        {
            "id": "304",
            "topic": "Mineralogy",
            "category": "Earth Sciences",
            "description": "Mineralogy's foundations trace to ancient civilizations with empirical knowledge of minerals for tools, pigments, and ornaments, and early attempts at mineral classification by Greeks and Romans (Theophrastus, Pliny). The Middle Ages saw limited advances with minerals studied primarily for alchemy and metallurgy. The Renaissance (16th-17th centuries) brought Georgius Agricola's De Re Metallica (1556) systematically describing minerals and mining, marking the beginning of scientific mineralogy. The 18th century witnessed development of chemical analysis techniques and Romé de l'Isle's recognition of constant interfacial angles in crystals (1783). 1784 brought René Just Haüy's discovery that crystal forms reflect internal atomic structure, founding crystallography. The early 1800s introduced chemical classification of minerals (Berzelius) and development of crystallographic notation. 1822 saw Friedrich Mohs establish his hardness scale. The late 1800s brought optical mineralogy development with petrographic microscopes, polarized light techniques, and systematic mineral descriptions. 1912-1913 revolutionized the field with X-ray crystallography (von Laue, Bragg), enabling determination of atomic structures. The 1920s-30s saw Victor Goldschmidt's crystal chemistry principles and geochemical mineral classification. The 1950s-60s brought electron microprobe analysis (EMPA) for precise chemical composition and clay mineralogy advances using XRD. The 1970s-80s introduced scanning electron microscopy (SEM) applications, Raman spectroscopy for mineral identification, and synthetic mineral production studies. The 1990s-2000s advanced with high-pressure mineralogy (deep Earth conditions), mineral databases and computational tools, and nanomineralogy emergence. The 2010s-2020s continue with synchrotron radiation techniques, in-situ mineral analysis, biomineralization studies, environmental mineralogy expansion, planetary mineralogy (Mars rovers, asteroid samples), and machine learning for mineral classification and discovery becoming cutting-edge research areas.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title <b>Mineralogy Evolution</b>\n    \n    section Ancient Foundations\n        Ancient Times : Empirical mineral knowledge\n                      : Tools, pigments, ornaments\n                      : Greek & Roman classification\n                      : Theophrastus, Pliny\n        Middle Ages : Alchemy & metallurgy focus\n    \n    section Scientific Beginnings\n        1556  : Agricola's \"De Re Metallica\"\n              : Systematic descriptions\n        1783  : Romé de l'Isle\n              : Constant interfacial angles\n        1784  : Haüy's discovery\n              : Crystal internal structure\n              : Crystallography founded\n    \n    section Classification Era\n        Early 1800s : Chemical classification\n                    : Berzelius\n                    : Crystallographic notation\n        1822  : Mohs hardness scale\n        Late 1800s : Optical mineralogy\n                   : Petrographic microscopes\n                   : Polarized light\n    \n    section Structural Revolution\n        1912-1913 : X-ray crystallography\n                  : von Laue, Bragg\n                  : Atomic structures\n        1920s-30s : Goldschmidt's principles\n                  : Crystal chemistry\n                  : Geochemical classification\n    \n    section Analytical Advances\n        1950s-60s : Electron microprobe (EMPA)\n                  : Precise composition\n                  : Clay mineralogy & XRD\n        1970s-80s : SEM applications\n                  : Raman spectroscopy\n                  : Synthetic minerals\n    \n    section Modern Era\n        1990s-2000s : High-pressure mineralogy\n                    : Mineral databases\n                    : Nanomineralogy\n        2010s-2020s : Synchrotron techniques\n                    : In-situ analysis\n                    : Biomineralization\n                    : Environmental mineralogy\n                    : Planetary mineralogy\n                    : Machine learning applications",
            "complexity": "high",
            "tags": [
                "mineralogy",
                "earth_sciences"
            ],
            "creation_date": "2025-01-27"
        }
    ]
}