{
    "diagrams": [
        {
            "id": "285",
            "topic": "Behavioral Finance",
            "category": "Business",
            "description": "Behavioral Finance encompasses cognitive biases, emotional factors, and market phenomena challenging rational finance assumptions. Cognitive biases include overconfidence causing excessive trading and risk-taking, anchoring fixing on irrelevant reference points, confirmation bias seeking supporting information while ignoring contradictory evidence, availability heuristic overweighting easily recalled events, and representativeness judging by stereotypes rather than base rates. Emotional biases involve loss aversion feeling losses more intensely than equivalent gains, regret aversion avoiding decisions that might cause future regret, self-control problems favoring immediate over delayed gratification, and mood effects linking emotions to risk preferences. Prospect theory explains reference dependence evaluating outcomes relative to reference points, loss aversion asymmetry, probability weighting overweighting small probabilities, and framing effects where presentation influences choices. Market anomalies include momentum continuation of past returns, value premium of undervalued stocks, size effect of small-cap outperformance, and calendar patterns like January effects. Heuristics employ mental shortcuts including representativeness, availability, and affect heuristic. Investor behavior shows disposition effect, herding, overtrading, and home bias favoring domestic investments.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Behavioral<br>Finance</b>))\n    <b>Cognitive Biases</b>\n      Overconfidence\n      Anchoring\n      Confirmation bias\n      Availability heuristic\n      Representativeness\n      Hindsight bias\n    <b>Emotional Biases</b>\n      Loss aversion\n      Regret aversion\n      Self-control problems\n      Mood effects\n      Optimism bias\n    <b>Prospect Theory</b>\n      Reference dependence\n      Loss aversion asymmetry\n      Probability weighting\n      Framing effects\n      Value function\n    <b>Market Anomalies</b>\n      Momentum effects\n      Value premium\n      Size effect\n      Calendar anomalies\n      Post-earnings drift\n      Reversal patterns\n    <b>Heuristics</b>\n      Representativeness\n      Availability\n      Affect heuristic\n      Recognition heuristic\n      Mental shortcuts\n    <b>Investor Behavior</b>\n      Disposition effect\n      Herding behavior\n      Overtrading\n      Home bias\n      Attention effects\n    <b>Bounded Rationality</b>\n      Cognitive limitations\n      Satisficing\n      Limited attention\n      Information overload\n    <b>Neurofinance</b>\n      Brain imaging studies\n      Neural mechanisms\n      Emotion-cognition interaction\n      Decision neuroscience",
            "complexity": "high",
            "tags": [
                "behavioral_finance",
                "business"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}