{
    "diagrams": [
        {
            "id": "286",
            "topic": "Venture Capital",
            "category": "Business",
            "description": "Venture Capital encompasses investment strategies, value-add services, and portfolio management practices for high-risk, high-return equity financing. Investment stages include pre-seed funding for idea validation, seed capital for product development and market testing, Series A for scaling proven business models, Series B-C for market expansion and growth acceleration, and late-stage financing preparing for exits. Investment criteria evaluate founder quality assessing vision, execution ability, and adaptability, market size requiring large total addressable markets with growth potential, competitive advantage through technology, network effects, or unique positioning, business model clarity with path to profitability, and traction evidence showing product-market fit. Due diligence areas cover technology assessment, market analysis, competitive landscape, financial modeling, legal review, and reference checks. Value-added services provide strategic planning, operational expertise, talent recruitment, customer introductions, follow-on fundraising support, and exit preparation. Fund structures include limited partnership agreements, management fees typically 2%, carried interest around 20%, fund lifecycle of 10 years, and capital calls for deployment. Portfolio construction balances risk through diversification, stage focus, sector specialization, and geographic concentration.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Venture<br>Capital</b>))\n    <b>Investment Stages</b>\n      Pre-seed funding\n      Seed capital\n      Series A\n      Series B-C\n      Late-stage financing\n      Bridge rounds\n    <b>Investment Criteria</b>\n      Founder quality\n      Market size\n      Competitive advantage\n      Business model clarity\n      Traction evidence\n      Scalability potential\n    <b>Due Diligence Areas</b>\n      Technology assessment\n      Market analysis\n      Competitive landscape\n      Financial modeling\n      Legal review\n      Reference checks\n    <b>Value-Added Services</b>\n      Strategic planning\n      Operational expertise\n      Talent recruitment\n      Customer introductions\n      Follow-on fundraising\n      Exit preparation\n    <b>Fund Structure</b>\n      Limited partnerships\n      Management fees 2%\n      Carried interest 20%\n      Fund lifecycle 10 years\n      Capital calls\n    <b>Portfolio Construction</b>\n      Diversification strategy\n      Stage focus\n      Sector specialization\n      Geographic concentration\n      Follow-on reserves\n    <b>Exit Strategies</b>\n      IPO public offering\n      Strategic acquisition\n      Secondary sales\n      Merger transactions\n    <b>Performance Metrics</b>\n      IRR calculation\n      MOIC multiples\n      DPI distributions\n      TVPI total value",
            "complexity": "high",
            "tags": [
                "venture_capital",
                "business"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}