{
    "diagrams": [
        {
            "id": "287",
            "topic": "Franchising",
            "category": "Business",
            "description": "Franchising encompasses business models, legal structures, and operational systems for brand expansion through independent operators. Franchise types include product distribution franchises licensing brand and products, business format franchises providing complete operating systems, master franchises granting regional development rights, and conversion franchises incorporating existing independent businesses. Franchise fees structure includes initial franchise fees for entry rights, ongoing royalties typically 4-8% of gross sales, advertising fund contributions for national marketing, and technology fees for systems access. Franchisor responsibilities provide brand development and protection, operations manual updates, training programs, marketing support, quality control systems, and innovation implementation. Franchisee obligations include upfront investment for setup costs, adherence to operating standards, territory exclusivity respect, quality maintenance, timely reporting, and fee payments. Legal requirements mandate franchise disclosure documents under FTC regulations, state registration in certain jurisdictions, relationship laws governing termination, and intellectual property protection. Support systems offer field support representatives, online learning platforms, vendor networks with negotiated pricing, technology infrastructure, and franchisee advisory councils. Quality assurance employs mystery shopping, regular inspections, customer feedback systems, and brand standard audits.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Franchising</b>))\n    <b>Franchise Types</b>\n      Product distribution\n      Business format\n      Master franchises\n      Conversion franchises\n      Area development\n    <b>Fee Structure</b>\n      Initial franchise fees\n      Ongoing royalties 4-8%\n      Advertising contributions\n      Technology fees\n      Renewal fees\n    <b>Franchisor Responsibilities</b>\n      Brand development\n      Operations manuals\n      Training programs\n      Marketing support\n      Quality control\n      Innovation\n    <b>Franchisee Obligations</b>\n      Upfront investment\n      Operating standards\n      Territory respect\n      Quality maintenance\n      Reporting compliance\n      Fee payments\n    <b>Legal Requirements</b>\n      FDD disclosure\n      State registration\n      Relationship laws\n      IP protection\n      Contract terms\n    <b>Support Systems</b>\n      Field representatives\n      Learning platforms\n      Vendor networks\n      Technology infrastructure\n      Advisory councils\n    <b>Quality Assurance</b>\n      Mystery shopping\n      Regular inspections\n      Customer feedback\n      Brand audits\n      Compliance monitoring\n    <b>Growth Strategies</b>\n      Geographic expansion\n      Multi-unit development\n      International franchising\n      Co-branding",
            "complexity": "high",
            "tags": [
                "franchising",
                "business"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}