{
    "diagrams": [
        {
            "id": "279",
            "topic": "Knowledge Management",
            "category": "Business",
            "description": "Knowledge Management emerged from information science and organizational learning research. Early library science and information management practices (1950s-1960s) laid foundations for systematic knowledge organization. Peter Drucker coined knowledge worker (1959) and knowledge economy concepts, recognizing intellectual capital's importance. Polanyi's work on tacit knowledge (1966) distinguished codified from experiential knowing. Organizational learning research by Argyris and Schön (1978) introduced single and double-loop learning concepts. The term knowledge management gained prominence in the 1990s as organizations recognized competitive advantages from knowledge assets. Nonaka and Takeuchi's SECI model (1995) explained knowledge creation in Japanese companies. Enterprise content management systems proliferated in the late 1990s-2000s. Web 2.0 technologies (mid-2000s) enabled collaborative wikis and social knowledge sharing. AI and machine learning (2010s) transformed knowledge discovery and retrieval. Today's knowledge management integrates conversational AI, knowledge graphs, and personalized learning experiences.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title Knowledge Management Evolution\n    1950s-1960s : Library & Information Science\n                : Systematic organization foundations\n    1959 : Knowledge Worker Concept\n         : Drucker's intellectual capital\n    1966 : Tacit Knowledge Theory\n         : Polanyi's experiential knowing\n    1978 : Organizational Learning\n         : Argyris & Schön's loop learning\n    1990s : KM Term Prominence\n          : Competitive knowledge assets\n    1995 : SECI Model\n         : Nonaka & Takeuchi's framework\n    Late 1990s-2000s : Enterprise Content Management\n                     : System proliferation\n    Mid-2000s : Web 2.0 Technologies\n              : Collaborative wikis\n    2010s : AI & Machine Learning\n          : Knowledge discovery transformation\n    2020s : Conversational AI & Graphs\n          : Personalized learning experiences",
            "complexity": "high",
            "tags": [
                "knowledge_management",
                "business"
            ],
            "creation_date": "2025-01-27"
        }
    ]
}