{
    "diagrams": [
        {
            "id": "281",
            "topic": "Business Law",
            "category": "Business",
            "description": "Business Law evolved from merchant customs to comprehensive regulatory frameworks. Roman law and medieval merchant courts (1000s-1500s) established early commercial legal principles. English common law developed contract and property doctrines through judicial precedent. The Industrial Revolution (1800s) necessitated corporate law development for limited liability companies. The Sherman Antitrust Act (1890) initiated US competition law to prevent monopolies. The Uniform Commercial Code, developed in the 1950s, standardized commercial transactions across US states. Securities regulation emerged after the 1929 crash with the Securities Act (1933) and Securities Exchange Act (1934). Employment law expanded significantly in the 1960s-1970s with Civil Rights Act, OSHA, and ERISA. Intellectual property protection strengthened with the Copyright Act (1976) and digital provisions. Sarbanes-Oxley (2002) enhanced corporate governance post-Enron. GDPR (2018) revolutionized data privacy regulation. Today's business law addresses cryptocurrency, AI liability, gig economy classification, and ESG disclosure requirements.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title A History of U.S. Business Law\n    section Early Republic\n        1789 : U.S. Constitution's Commerce Clause\n        1819 : Dartmouth College v. Woodward - protects corporate charters\n    section Industrial Era\n        1890 : Sherman Antitrust Act\n        1914 : Federal Trade Commission (FTC) Act\n    section New Deal Era\n        1933 : Securities Act of 1933\n        1934 : Securities Exchange Act of 1934\n        1935 : National Labor Relations Act (Wagner Act)\n    section Post-War Era\n        1952 : Uniform Commercial Code (UCC) first published\n        1964 : Civil Rights Act (Title VII - Employment Discrimination)\n    section Late 20th & 21st Century\n        1970 : Occupational Safety and Health Act (OSHA)\n        2002 : Sarbanes-Oxley Act (SOX)\n        2010 : Dodd-Frank Wall Street Reform and Consumer Protection Act",
            "complexity": "high",
            "tags": [
                "business_law",
                "business"
            ],
            "creation_date": "2025-01-27"
        }
    ]
}
