{
    "diagrams": [
        {
            "id": "285",
            "topic": "Behavioral Finance",
            "category": "Business",
            "description": "Behavioral Finance emerged from psychology-economics integration challenging rational expectations. Early behavioral economics work by Herbert Simon on bounded rationality (1950s) questioned unlimited cognitive capacity assumptions. Daniel Kahneman and Amos Tversky's research on judgment under uncertainty (1970s) revealed systematic cognitive biases. Their prospect theory (1979) explained decision-making under risk through reference dependence and loss aversion, eventually earning Kahneman the Nobel Prize in Economics (2002). Richard Thaler pioneered behavioral finance applications in the 1980s, documenting anomalies like the equity premium puzzle and endowment effect. Robert Shiller's work on market volatility (1980s-1990s) challenged efficient market theory. Behavioral portfolio theory emerged in the 1990s as alternative to mean-variance optimization. The dot-com bubble (2000) provided real-world validation of irrational exuberance concepts. Nudge theory by Thaler and Sunstein (2008) influenced policy design. Neurofinance emerged in the 2000s using brain imaging. Today's behavioral finance integrates big data analytics, robo-advising behavioral guardrails, and choice architecture in digital platforms.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title The History of Behavioral Finance\n    section Early Concepts\n        1841 : Charles Mackay - \"Extraordinary Popular Delusions and the Madness of Crowds\"\n        1936 : John Maynard Keynes - \"Animal Spirits\"\n    section The Foundations\n        1972 : Paul Slovic - \"Psychology of Risk Taking\"\n        1979 : Kahneman & Tversky - Prospect Theory\n    section The Rise of Behavioral Finance\n        1985 : De Bondt & Thaler - The Overreaction Hypothesis\n        1991 : Robert Shiller - \"Market Volatility\"\n        1994 : Shefrin & Statman - Myopic Loss Aversion\n    section 21st Century\n        2002 : Daniel Kahneman wins Nobel Prize in Economics\n        2013 : Robert Shiller wins Nobel Prize in Economics\n        2017 : Richard Thaler wins Nobel Prize in Economics",
            "complexity": "high",
            "tags": [
                "behavioral_finance",
                "business"
            ],
            "creation_date": "2025-01-27"
        }
    ]
}
