{
    "diagrams": [
        {
            "id": "286",
            "topic": "Venture Capital",
            "category": "Business",
            "description": "Venture Capital evolved from wealthy family investments to institutionalized asset class driving innovation economies. Early venture investments by wealthy individuals and families (1800s-early 1900s) funded railroads, oil, and manufacturing. The modern venture capital industry began with American Research and Development Corporation (1946), the first institutional VC firm, funding Digital Equipment Corporation's success. Silicon Valley emerged as venture hub in the 1960s-1970s with semiconductor and computer investments. The National Venture Capital Association formed in 1973 to represent the industry. Kleiner Perkins, Sequoia Capital, and other legendary firms established in the 1970s. Regulatory changes in 1979 allowed pension funds to invest in venture capital, dramatically expanding capital availability. The dot-com boom (1995-2000) brought unprecedented VC activity and subsequent bust correction. The rise of Google, Facebook, and social media (2000s) validated internet business models. Seed funding explosion and accelerator models like Y Combinator (2005) democratized early-stage investing. Today's venture capital integrates global reach, sector specialization, corporate venture arms, and emerging technologies like AI, blockchain, and biotechnology.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title Venture Capital Evolution\n    1800s-Early 1900s : Wealthy Family Investments\n                      : Railroad & oil funding\n    1946 : ARDC Founded\n         : First institutional VC firm\n    1960s-1970s : Silicon Valley Emergence\n                : Semiconductor investments\n    1970s : Legendary Firms Established\n          : Kleiner Perkins, Sequoia\n    1973 : NVCA Formation\n         : Industry representation\n    1979 : Pension Fund Rule Change\n         : Capital availability expansion\n    1995-2000 : Dot-com Boom & Bust\n              : Internet investment wave\n    2000s : Social Media Rise\n          : Google, Facebook validation\n    2005 : Y Combinator Launch\n         : Accelerator model emergence\n    2010s : Unicorn Era\n          : Billion-dollar startups\n    2020s : Global & Specialized\n          : AI, blockchain & biotech focus",
            "complexity": "high",
            "tags": [
                "venture_capital",
                "business"
            ],
            "creation_date": "2025-01-27"
        }
    ]
}