{
    "diagrams": [
        {
            "id": "288",
            "topic": "Consulting",
            "category": "Business",
            "description": "Consulting evolved from individual advisory to global professional services industry. Early management consulting emerged with Frederick Taylor's scientific management (1911), applying systematic analysis to industrial operations. Arthur D. Little founded the first management consulting firm (1886), initially focused on technical and research services. McKinsey & Company (1926) pioneered general management consulting for top executives. Post-WWII expansion saw Boston Consulting Group (1963) and Bain & Company (1973) establish strategy consulting prominence. The Big Eight accounting firms (later Big Four) expanded into management consulting in the 1970s-1980s. IT consulting boomed with enterprise software implementations in the 1990s. The dot-com era brought digital strategy consulting. Sarbanes-Oxley (2002) forced accounting firms to separate consulting and audit practices. The 2008 financial crisis emphasized operational efficiency and cost reduction consulting. Digital transformation and cloud migration dominated the 2010s. Today's consulting integrates AI implementation, sustainability strategy, remote delivery models, and outcome-based pricing.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title Consulting Evolution\n    1886 : Arthur D. Little Founded\n         : First consulting firm\n    1911 : Scientific Management\n         : Taylor's systematic analysis\n    1926 : McKinsey & Company\n         : General management consulting\n    1963 : BCG Established\n         : Strategy consulting prominence\n    1973 : Bain & Company\n         : Results-oriented approach\n    1970s-1980s : Big Eight Expansion\n                : Accounting firms into consulting\n    1990s : IT Consulting Boom\n          : Enterprise software era\n    2000s : Digital Strategy\n          : Dot-com consulting wave\n    2002 : Sarbanes-Oxley\n         : Audit-consulting separation\n    2010s : Digital Transformation\n          : Cloud & analytics focus\n    2020s : AI & Sustainability\n          : Emerging tech & ESG strategy",
            "complexity": "high",
            "tags": [
                "consulting",
                "business"
            ],
            "creation_date": "2025-01-27"
        }
    ]
}