{
    "diagrams": [
        {
            "id": "289",
            "topic": "Brand Management",
            "category": "Business",
            "description": "Brand Management evolved from simple product identification to sophisticated strategic discipline. Early branding began with medieval guild marks and cattle branding for ownership identification. The Industrial Revolution (1800s) brought packaged goods requiring brand differentiation as products moved from local to national markets. Procter & Gamble pioneered brand management systems in 1931, creating the brand manager role for dedicated product focus. David Ogilvy's advertising philosophy (1950s-1960s) emphasized brand image over product features. Positioning theory by Al Ries and Jack Trout (1970s) revolutionized strategic differentiation. Brand equity concepts formalized in the 1980s-1990s through David Aaker's framework quantifying brand value. The Brand Asset Valuator developed by Young & Rubicam (1993) provided systematic equity measurement. Digital branding emerged with internet adoption in the late 1990s-2000s. Social media transformed brand-customer relationships in the 2000s-2010s requiring real-time engagement. Purpose-driven branding gained prominence in the 2010s emphasizing social responsibility. Today's brand management integrates influencer partnerships, user-generated content, personalization at scale, and sustainability credentials.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title Brand Management Evolution\n    Medieval Era : Guild Marks\n                 : Ownership identification\n    1800s : Industrial Revolution\n          : Packaged goods branding\n    1931 : P&G Brand Manager System\n         : Dedicated product focus role\n    1950s-1960s : Ogilvy's Brand Image\n                : Image over features\n    1970s : Positioning Theory\n          : Ries & Trout differentiation\n    1980s-1990s : Brand Equity Formalized\n                : Aaker's framework\n    1993 : Brand Asset Valuator\n         : Systematic equity measurement\n    Late 1990s-2000s : Digital Branding\n                     : Internet adoption\n    2000s-2010s : Social Media Transformation\n                : Real-time engagement\n    2010s : Purpose-Driven Branding\n          : Social responsibility emphasis\n    2020s : Personalization & Sustainability\n          : Scale customization & ESG focus",
            "complexity": "high",
            "tags": [
                "brand_management",
                "business"
            ],
            "creation_date": "2025-01-27"
        }
    ]
}