{
    "diagrams": [
        {
            "id": "045",
            "topic": "Systems Engineering",
            "category": "Engineering",
            "description": "Systems Engineering emerged from post-WWII complexity in aerospace and defense programs. Early systems engineering practices developed during WWII (1940s) for radar, weapons, and communication systems integration. Bell Telephone Laboratories pioneered systematic engineering approaches in the 1940s-1950s for telecommunications infrastructure. The Apollo space program (1960s) demonstrated large-scale systems engineering managing unprecedented complexity and interdependencies. The International Council on Systems Engineering (INCOSE) formed in 1990 to advance the profession and develop standards. The Systems Engineering Body of Knowledge (SEBoK) established in the 1990s-2000s. Model-Based Systems Engineering (MBSE) emerged in the 2000s, shifting from document-centric to model-centric approaches. Digital transformation in the 2010s integrated systems engineering with software development through DevOps and continuous delivery. ISO/IEC/IEEE 15288 standard (2015) provided international framework for system lifecycle processes. Today's systems engineering addresses cyber-physical systems, autonomous vehicles, smart cities, and AI integration requiring multidisciplinary collaboration across traditional engineering boundaries.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title The History of Systems Engineering\n    section Early 20th Century\n        1940s : Bell Labs pioneers the field during WWII\n        1950s : RAND Corporation develops systems analysis for military applications\n    section The Space Race\n        1960s : NASA applies systems engineering to the Apollo program\n        1969 : MIL-STD-499 - first military standard for systems engineering\n    section The Computer Age\n        1970s : Development of structured analysis and design methodologies\n        1980s : Growth of computer-aided systems engineering (CASE) tools\n    section The Modern Era\n        1990 : International Council on Systems Engineering (INCOSE) is founded\n        1997 : UML (Unified Modeling Language) is adopted\n        2000s : Model-Based Systems Engineering (MBSE)\n        2010s : Increased focus on complex, software-intensive systems & system of systems",
            "complexity": "high",
            "tags": [
                "systems_engineering",
                "engineering"
            ],
            "creation_date": "2025-11-10"
        }
    ]
}
