{
    "diagrams": [
        {
            "id": "051",
            "topic": "Databases",
            "category": "Engineering",
            "description": "Databases evolved from file systems to sophisticated distributed data management platforms. Early data storage used flat files and sequential access (1950s-1960s). The hierarchical database model emerged with IMS (1966) organizing data in tree structures. The network database model (1969) introduced many-to-many relationships. Edgar Codd's relational model paper (1970) revolutionized database theory with mathematical foundations. SQL development at IBM (1970s) provided standard query language. The relational database management systems commercialized in the late 1970s with Oracle and Ingres. Object-oriented databases emerged in the 1980s supporting complex data types. SQL standardization (1986) promoted interoperability across vendors. Data warehousing concepts developed in the 1990s for business intelligence. The term NoSQL appeared around 2009 addressing web-scale data challenges. MongoDB (2009) popularized document databases. Apache Cassandra provided distributed column-family storage. NewSQL databases (2010s) combined relational guarantees with NoSQL scalability. Cloud database services like Amazon RDS transformed deployment. Today's databases integrate serverless architectures, multi-model capabilities, blockchain databases, and AI-powered query optimization.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title Databases Evolution\n    1950s-1960s : Flat File Systems\n                : Sequential access storage\n    1966 : Hierarchical Model IMS\n         : Tree structure organization\n    1969 : Network Database Model\n         : Many-to-many relationships\n    1970 : Codd's Relational Model\n         : Mathematical foundations\n    1970s : SQL Development\n          : Standard query language\n    Late 1970s : RDBMS Commercialization\n               : Oracle & Ingres\n    1980s : Object-Oriented Databases\n          : Complex data types\n    1986 : SQL Standardization\n         : Vendor interoperability\n    1990s : Data Warehousing\n          : Business intelligence\n    2009 : NoSQL Emergence\n         : Web-scale challenges\n    2009 : MongoDB Launch\n         : Document database popularity\n    2010s : NewSQL Databases\n          : Relational + NoSQL scalability\n    2020s : Serverless & Multi-Model\n          : Cloud-native AI optimization",
            "complexity": "high",
            "tags": [
                "databases",
                "engineering"
            ],
            "creation_date": "2025-11-10"
        }
    ]
}