{
    "diagrams": [
        {
            "id": "060",
            "topic": "Civil Engineering",
            "category": "Engineering",
            "description": "Civil engineering traces back to ancient civilizations with monumental structures like Egyptian pyramids, Roman aqueducts, and roads demonstrating early engineering principles. The Middle Ages brought Gothic cathedrals and fortifications. The 18th century saw the profession formalize with the establishment of civil engineering societies and John Smeaton being considered the first self-proclaimed civil engineer (1750s). The Industrial Revolution (1800s) revolutionized the field with iron and steel structures, suspension bridges, and railway systems. 1883 completed the Brooklyn Bridge, showcasing modern bridge engineering. The early 1900s introduced reinforced concrete, skyscrapers, and modern highway systems. The 1950s-60s witnessed interstate highway development and massive dam projects. The 1970s-80s brought computer-aided design and finite element analysis. The 1990s-2000s advanced with prestressed concrete, seismic design improvements, and sustainable construction practices. The 2010s-2020s continue with BIM technology, smart infrastructure, green building standards, and resilient design for climate adaptation.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title The History of Civil Engineering\n    section Ancient World\n        c. 2700-2200 BC : Pyramids of Egypt and other monumental structures\n        c. 4000-500 BC : Roman aqueducts, roads, and bridges\n    section The Middle Ages\n        c. 1100-1500 : Gothic cathedrals\n    section The 18th & 19th Centuries\n        1771 : John Smeaton, the \"father of civil engineering\"\n        1818 : Institution of Civil Engineers founded in London\n        1825 : Erie Canal completed\n    section The 20th Century\n        1931 : Empire State Building completed\n        1936 : Hoover Dam completed\n        1950s : Development of modern project management techniques\n        1994 : Channel Tunnel completed\n    section The 21st Century\n        2000s : Rise of sustainable engineering and green building\n        2010s : Use of BIM (Building Information Modeling) and other digital tools",
            "complexity": "high",
            "tags": [
                "civil_engineering",
                "engineering"
            ],
            "creation_date": "2025-11-10"
        }
    ]
}
