{
    "diagrams": [
        {
            "id": "064",
            "topic": "Aerospace Engineering",
            "category": "Engineering",
            "description": "Aerospace engineering's origins trace to 1903 with the Wright Brothers' first powered flight at Kitty Hawk, establishing heavier-than-air flight principles. World War I (1914-1918) accelerated aircraft development for military purposes. The 1920s-30s brought commercial aviation expansion, metal aircraft construction, and jet engine concept development (Frank Whittle 1930, Hans von Ohain 1936). World War II (1939-1945) saw rapid advances with the first operational jet aircraft and V-2 rockets. The 1950s introduced supersonic flight (Chuck Yeager broke the sound barrier in 1947) and the beginning of the Space Age with Sputnik (1957). The 1960s witnessed the Apollo program leading to the moon landing (1969) and commercial jet age expansion. The 1970s-80s brought wide-body aircraft, Space Shuttle development, and composite materials adoption. The 1990s-2000s saw stealth technology, GPS integration, and International Space Station construction. The 2010s-2020s continue with reusable rockets (SpaceX), commercial spaceflight, electric aircraft development, hypersonic vehicles, and autonomous flight systems becoming reality.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title The History of Aerospace Engineering\n    section The Dawn of Flight\n        1903 : Wright Brothers - First powered flight\n        1927 : Charles Lindbergh - First solo transatlantic flight\n    section The Jet Age\n        1939 : The Heinkel He 178, the first jet aircraft\n        1947 : Chuck Yeager breaks the sound barrier\n        1952 : The de Havilland Comet, the first commercial jet airliner\n    section The Space Race\n        1957 : Sputnik 1, the first artificial satellite\n        1961 : Yuri Gagarin, the first human in space\n        1969 : Apollo 11, the first humans on the Moon\n    section The Shuttle Era and Beyond\n        1981 : The first Space Shuttle launch\n        1998 : The International Space Station (ISS) begins construction\n    section The 21st Century: The New Space Age\n        2000s : Rise of private spaceflight (e.g., SpaceX, Blue Origin)\n        2010s : Advancements in reusable rockets and CubeSats",
            "complexity": "high",
            "tags": [
                "aerospace_engineering",
                "engineering"
            ],
            "creation_date": "2025-11-10"
        }
    ]
}
