{
    "diagrams": [
        {
            "id": "065",
            "topic": "Biomedical Engineering",
            "category": "Engineering",
            "description": "Biomedical engineering's foundations emerged in the early 1900s with Willem Einthoven's ECG invention (1903) and the development of early X-ray technology. The 1920s-30s brought the iron lung ventilator and early prosthetic developments. The 1950s marked the field's formal establishment with the first pacemaker (1958) and dialysis machines. The 1960s witnessed heart-lung machines enabling open-heart surgery and the first successful hip replacement (John Charnley). The 1970s introduced CT scanning (Hounsfield, 1971), biomedical engineering degree programs proliferation, and cochlear implants. The 1980s brought MRI technology to clinical use, artificial heart developments, and arthroscopic surgical techniques. The 1990s saw robotic surgery systems (da Vinci), tissue engineering advances, and the Human Genome Project. The 2000s advanced with drug-eluting stents, 3D medical imaging improvements, and stem cell research progress. The 2010s-2020s continue with CRISPR gene editing, 3D-printed organs and implants, AI-assisted diagnostics, wearable health monitors, brain-computer interfaces, and personalized medicine becoming clinical realities.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title The History of Biomedical Engineering\n    section Early Developments\n        1895 : Wilhelm Roentgen discovers X-rays\n        1903 : Willem Einthoven invents the electrocardiograph (ECG)\n        1927 : The iron lung is invented\n    section Mid-20th Century: The Rise of Medical Devices\n        1943 : Willem Kolff develops the first artificial kidney (dialysis machine)\n        1952 : The first successful implantation of an artificial heart valve\n        1958 : The first implantable pacemaker\n    section Late 20th Century: Imaging and Biotechnology\n        1971 : The first CT scanner is invented\n        1977 : The first MRI scan\n        1980s : Development of genetic engineering and tissue engineering\n    section 21st Century: The Digital and Genomic Eras\n        2003 : The Human Genome Project is completed\n        2010s : Rise of wearable technology and personalized medicine\n        2020s : Advancements in gene editing (e.g., CRISPR)",
            "complexity": "high",
            "tags": [
                "biomedical_engineering",
                "engineering"
            ],
            "creation_date": "2025-11-10"
        }
    ]
}
