{
    "diagrams": [
        {
            "id": "067",
            "topic": "Nuclear Engineering",
            "category": "Engineering",
            "description": "Nuclear engineering emerged from the discovery of radioactivity (1896) by Henri Becquerel and subsequent research by Marie and Pierre Curie. 1905 brought Einstein's E=mc² equation establishing mass-energy equivalence. 1932 witnessed neutron discovery (James Chadwick) and 1938 saw nuclear fission discovery (Otto Hahn, Fritz Strassmann). The Manhattan Project (1942-1945) developed the first nuclear weapons and created the first controlled nuclear chain reaction (Enrico Fermi, Chicago Pile-1, 1942). The 1950s marked peaceful nuclear energy development with the first nuclear power plant (Obninsk, USSR, 1954) and first commercial US reactor (Shippingport, 1957). The 1960s-70s witnessed rapid nuclear power expansion worldwide and development of various reactor designs. The 1979 Three Mile Island accident and 1986 Chernobyl disaster prompted enhanced safety regulations. The 1990s-2000s brought Generation III+ reactor designs with improved safety features. 2011's Fukushima accident further advanced safety standards. The 2010s-2020s continue with small modular reactor development, Generation IV concepts, fusion energy progress (ITER project), and advanced fuel cycles emphasizing sustainability and waste reduction.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title The History of Nuclear Engineering\n    section Early Discoveries\n        1895 : Wilhelm Röntgen discovers X-rays\n        1896 : Henri Becquerel discovers radioactivity\n        1938 : Otto Hahn and Fritz Strassmann discover nuclear fission\n    section The Manhattan Project\n        1942 : Chicago Pile-1, the first artificial nuclear reactor\n        1945 : The Trinity test, the first detonation of a nuclear weapon\n    section The Atomic Age\n        1951 : Experimental Breeder Reactor I (EBR-I), the first to generate electricity\n        1954 : The first nuclear submarine, USS Nautilus\n        1957 : The first commercial nuclear power plant (Shippingport, Pennsylvania)\n    section The Cold War and Beyond\n        1979 : Three Mile Island accident\n        1986 : Chernobyl disaster\n    section The 21st Century\n        2000s : Development of Generation III+ reactors\n        2010s : Renewed interest in small modular reactors (SMRs)",
            "complexity": "high",
            "tags": [
                "nuclear_engineering",
                "engineering"
            ],
            "creation_date": "2025-11-10"
        }
    ]
}
