{
    "diagrams": [
        {
            "id": "069",
            "topic": "Bioengineering",
            "category": "Engineering",
            "description": "Bioengineering's foundations emerged in the 1950s-60s with DNA structure discovery (Watson and Crick, 1953) and the genetic code decipherment. 1973 marked the first recombinant DNA experiments (Cohen and Boyer), launching modern genetic engineering. The 1970s brought restriction enzyme use, gene cloning techniques, and the biotechnology industry's birth. 1982 saw the first genetically engineered drug (human insulin) approved. The 1980s witnessed PCR invention (Kary Mullis, 1983), monoclonal antibody technology, and transgenic animal development. The 1990s brought the Human Genome Project initiation (1990), first GM crops commercialization, and tissue engineering advances. 1996 produced Dolly the sheep through cloning. The 2000s completed the Human Genome Project (2003), advanced stem cell research, and developed RNAi technology. 2012 revolutionized the field with CRISPR-Cas9 gene editing (Doudna and Charpentier). The 2010s-2020s continue with synthetic biology expansion, CAR-T cell therapy for cancer, organoid development, gene therapy approvals, CRISPR clinical trials, and mRNA vaccine technology demonstrating bioengineering's transformative healthcare impact.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title The History of Bioengineering\n    section Early Concepts\n        18th Century : Luigi Galvani - \"Animal electricity\"\n        1928 : Alexander Fleming - Discovery of penicillin\n    section Mid-20th Century: The Birth of a Field\n        1953 : Watson and Crick - Structure of DNA\n        1953 : First Ph.D. in Bioengineering (University of Pennsylvania)\n        1973 : Recombinant DNA technology\n    section Late 20th Century: Genetic Engineering\n        1982 : First genetically engineered drug (Humulin)\n        1990 : The Human Genome Project begins\n        1996 : Dolly the sheep is cloned\n    section 21st Century: Synthetic Biology and Beyond\n        2000s : Rise of tissue engineering and regenerative medicine\n        2010 : First synthetic cell created by the J. Craig Venter Institute\n        2012 : CRISPR-Cas9 gene editing technology is developed",
            "complexity": "high",
            "tags": [
                "bioengineering",
                "engineering"
            ],
            "creation_date": "2025-11-10"
        }
    ]
}
