{
    "diagrams": [
        {
            "id": "072",
            "topic": "Transportation Engineering",
            "category": "Engineering",
            "description": "Transportation engineering evolved from ancient road systems (Roman roads, Silk Road) demonstrating early engineering principles. The 18th-19th centuries brought systematic road construction methods (Telford, McAdam) and railway development revolutionizing land transport. The early 1900s witnessed automobile proliferation necessitating paved roads and the first traffic signals (1914). The 1920s-30s introduced highway planning principles, early traffic engineering studies, and parkway development. The 1950s-60s marked the Interstate Highway System construction in the U.S. (initiated 1956), urban freeway development, and traffic engineering formalization. The 1970s brought transportation planning models, environmental impact considerations, and public transit investments. The 1980s-90s introduced intelligent transportation systems (ITS), traffic simulation software, and sustainable transportation concepts. The 2000s advanced with GPS navigation, traffic management centers, bus rapid transit systems, and complete streets design. The 2010s-2020s continue with autonomous vehicle testing, mobility as a service platforms, electric vehicle infrastructure deployment, micromobility integration (bike-sharing, e-scooters), connected and automated vehicles, and data-driven transportation planning becoming standard practice.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title The History of Transportation\n    section Ancient Times\n        c. 3500 BC : Invention of the wheel\n        Roman Empire : Extensive road network (e.g., Appian Way)\n    section 18th & 19th Centuries: The Industrial Revolution\n        1787 : First steamboat (John Fitch)\n        1804 : First steam locomotive (Richard Trevithick)\n        1886 : First gasoline-powered automobile (Karl Benz)\n    section Early 20th Century: The Age of Flight and Mass Production\n        1903 : Wright Brothers' first flight\n        1908 : Ford Model T, the first mass-produced car\n        1956 : U.S. Interstate Highway System is authorized\n    section Mid-to-Late 20th Century: The Jet Age and Space Race\n        1952 : First commercial jet airliner\n        1957 : Sputnik 1 launches the Space Race\n        1964 : Shinkansen (bullet train) in Japan\n    section 21st Century: The Digital and Sustainable Eras\n        2000s : Development of GPS and intelligent transportation systems (ITS)\n        2010s : Rise of electric vehicles (EVs) and autonomous driving\n        2020s : Focus on sustainable transportation and micromobility",
            "complexity": "high",
            "tags": [
                "transportation_engineering",
                "engineering"
            ],
            "creation_date": "2025-11-10"
        }
    ]
}
