{
    "diagrams": [
        {
            "id": "075",
            "topic": "3D Printing",
            "category": "Engineering",
            "description": "3D printing's origins trace to 1984 when Chuck Hull invented stereolithography (SLA) and coined the term 3D printing. 1986 saw Hull founding 3D Systems and filing the SLA patent. 1988 introduced Selective Laser Sintering (SLS) by Carl Deckard at University of Texas. 1989 brought Fused Deposition Modeling (FDM) development by Scott Crump (Stratasys founded). The 1990s witnessed industrial adoption for rapid prototyping, multiple 3D printing companies emerging, and early bioprinting research. 2005 marked the RepRap project launch by Adrian Bowyer, initiating the open-source 3D printing movement. 2009 saw FDM patents expiring, enabling affordable consumer 3D printers. The 2010s brought explosive growth with desktop 3D printers (MakerBot, Ultimaker), metal 3D printing advancements, bioprinting progress (organ printing research), and aerospace adoption (GE printing fuel nozzles). 2013 introduced carbon fiber 3D printing. The 2015-2020 period witnessed multi-material printing, continuous printing technologies (CLIP), and construction-scale 3D printing. The 2020s continue with mass customization, metal printing for production parts, 4D printing (shape-changing materials), AI-optimized designs, sustainable materials, and space manufacturing applications becoming reality.",
            "diagram_type": "timeline",
            "mermaid_code": "timeline\n    title: The History of 3D Printing\n    section: The 1980s - The Birth of Additive Manufacturing\n        1981: Hideo Kodama's rapid prototyping system\n        1986: Chuck Hull patents Stereolithography (SLA)\n        1987: Carl Deckard patents Selective Laser Sintering (SLS)\n        1989: S. Scott Crump patents Fused Deposition Modeling (FDM)\n    section: The 1990s - Commercialization and Growth\n        1990s: The first commercial 3D printers are sold\n        1999: The first 3D-printed organ (a bladder) is implanted\n    section: The 2000s - The Open Source Revolution\n        2005: The RepRap Project, a self-replicating 3D printer, is founded\n        2009: MakerBot is founded\n    section: The 2010s - The Age of the Consumer\n        2010s: Expiration of key patents leads to a boom in consumer 3D printing\n        2014: 3D printing is used to create a prosthetic jaw\n    section: The 2020s - The Industrial Revolution\n        2020s: 3D printing is increasingly used for mass production\n        2020s: Advancements in metal 3D printing and bioprinting",
            "complexity": "high",
            "tags": [
                "3d_printing",
                "engineering"
            ],
            "creation_date": "2025-11-10"
        }
    ]
}
