{
    "diagrams": [
        {
            "id": "296",
            "topic": "Atmospheric Pollution",
            "category": "Environmental Sciences",
            "description": "Air Pollution encompasses diverse sources, pollutants, and impacts. Major sources include stationary sources (coal-fired power plants, industrial facilities, refineries, chemical plants), mobile sources (automobiles, trucks, airplanes, ships), area sources (agricultural operations, construction sites, residential heating), and natural sources (volcanic eruptions, wildfires, dust storms, sea spray). Primary pollutants include particulate matter (PM10, PM2.5 from combustion and mechanical processes), nitrogen oxides (NOx from combustion at high temperatures), sulfur dioxide (SO2 from coal burning and industrial processes), carbon monoxide (CO from incomplete combustion), volatile organic compounds (VOCs from solvents, fuels, industrial processes), and lead (from legacy sources). Secondary pollutants feature ground-level ozone (O3 formed from NOx and VOC reactions), secondary particulates, and peroxyacetyl nitrates (PANs). Health effects span respiratory diseases (asthma, bronchitis, COPD), cardiovascular impacts (heart attacks, strokes), cancer risks from carcinogens, premature mortality, and vulnerable population impacts (children, elderly). Environmental impacts include acid rain (damaging forests and aquatic ecosystems), visibility impairment (haze), crop damage, material corrosion, and climate effects. Control technologies involve particulate removal (electrostatic precipitators, baghouses, cyclones), gas treatment (scrubbers for SO2, catalytic converters for NOx and CO, selective catalytic reduction), and emission prevention (fuel switching, process modifications). Monitoring systems use ground stations with continuous analyzers, satellite remote sensing, air quality indices (AQI), and modeling (dispersion models, photochemical models). Regulatory frameworks include Clean Air Act, National Ambient Air Quality Standards (NAAQS), emission standards for vehicles and industries, and international agreements.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Air<br>Pollution</b>))\n    <b>Major Sources</b>\n      Stationary\n        Power Plants\n        Industrial Facilities\n        Refineries\n        Chemical Plants\n      Mobile\n        Automobiles\n        Trucks\n        Airplanes\n        Ships\n      Area Sources\n        Agriculture\n        Construction\n        Residential Heating\n      Natural\n        Volcanic Eruptions\n        Wildfires\n        Dust Storms\n        Sea Spray\n    <b>Primary Pollutants</b>\n      Particulate Matter\n        PM10\n        PM2.5\n      Nitrogen Oxides (NOx)\n      Sulfur Dioxide (SO2)\n      Carbon Monoxide (CO)\n      Volatile Organic Compounds\n      Lead\n    <b>Secondary Pollutants</b>\n      Ground-level Ozone (O3)\n      Secondary Particulates\n      PANs\n    <b>Health Effects</b>\n      Respiratory Diseases\n        Asthma\n        Bronchitis\n        COPD\n      Cardiovascular Impacts\n        Heart Attacks\n        Strokes\n      Cancer Risks\n      Premature Mortality\n      Vulnerable Populations\n        Children\n        Elderly\n    <b>Environmental Impacts</b>\n      Acid Rain\n        Forest Damage\n        Aquatic Ecosystem Harm\n      Visibility Impairment\n      Crop Damage\n      Material Corrosion\n      Climate Effects\n    <b>Control Technologies</b>\n      Particulate Removal\n        Electrostatic Precipitators\n        Baghouses\n        Cyclones\n      Gas Treatment\n        Scrubbers (SO2)\n        Catalytic Converters\n        SCR (NOx)\n      Emission Prevention\n        Fuel Switching\n        Process Modifications\n    <b>Monitoring Systems</b>\n      Ground Stations\n      Satellite Remote Sensing\n      Air Quality Index (AQI)\n      Modeling\n        Dispersion Models\n        Photochemical Models\n    <b>Regulatory Frameworks</b>\n      Clean Air Act\n      NAAQS\n      Emission Standards\n        Vehicles\n        Industries\n      International Agreements",
            "complexity": "high",
            "tags": [
                "atmospheric_pollution",
                "environmental_sciences"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}