{
    "diagrams": [
        {
            "id": "301",
            "topic": "Hydrology",
            "category": "Earth Sciences",
            "description": "Hydrology encompasses multiple processes, measurements, and applications. The hydrological cycle components include precipitation (rainfall, snowfall, hail), interception (by vegetation canopy), evaporation (from water surfaces), transpiration (from plants), evapotranspiration (combined loss), infiltration (into soil), percolation (to groundwater), surface runoff (overland flow to streams), streamflow (channel flow), and groundwater flow (subsurface movement). Watershed characteristics feature drainage area, topography and slope, soil types and properties, land use and land cover, channel network geometry, and time of concentration. Surface water processes involve rainfall-runoff transformation, hydrograph analysis (rising limb, peak, recession), flood routing, baseflow separation, and snowmelt hydrology. Groundwater hydrology includes aquifer types (confined, unconfined, perched), Darcy's Law governing flow, hydraulic conductivity and transmissivity, storativity and specific yield, groundwater recharge mechanisms, and well hydraulics (drawdown, cone of depression). Hydrological models span empirical models (rational method, SCS curve number), conceptual models (unit hydrograph, Sacramento model), physically-based models (distributed models, finite element methods), and integrated models (SWAT, HEC-HMS, MIKE SHE, MODFLOW for groundwater). Measurement techniques include rain gauges (tipping bucket, weighing), stream gauging (rating curves, velocity-area method, acoustic Doppler), groundwater monitoring (piezometers, water level recorders), soil moisture sensors, weather stations (meteorological data), and remote sensing (satellite precipitation estimates, GRACE for groundwater, radar). Applications cover flood forecasting and warning, water supply assessment, drought monitoring and prediction, irrigation planning, hydropower design, contaminant transport modeling, ecosystem flow requirements, and climate change impact studies. Specialized fields include urban hydrology (stormwater management), ecohydrology (vegetation-water interactions), isotope hydrology (water source tracing), and cryosphere hydrology (snow and ice processes).",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Hydrology</b>))\n    <b>Hydrological Cycle</b>\n      Precipitation\n        Rainfall\n        Snowfall\n        Hail\n      Interception\n      Evaporation\n      Transpiration\n      Evapotranspiration\n      Infiltration\n      Percolation\n      Surface Runoff\n      Streamflow\n      Groundwater Flow\n    <b>Watershed Characteristics</b>\n      Drainage Area\n      Topography & Slope\n      Soil Types & Properties\n      Land Use & Cover\n      Channel Network\n      Time of Concentration\n    <b>Surface Water Processes</b>\n      Rainfall-Runoff\n      Hydrograph Analysis\n        Rising Limb\n        Peak\n        Recession\n      Flood Routing\n      Baseflow Separation\n      Snowmelt Hydrology\n    <b>Groundwater Hydrology</b>\n      Aquifer Types\n        Confined\n        Unconfined\n        Perched\n      Darcy's Law\n      Hydraulic Conductivity\n      Transmissivity\n      Storativity\n      Groundwater Recharge\n      Well Hydraulics\n        Drawdown\n        Cone of Depression\n    <b>Hydrological Models</b>\n      Empirical Models\n        Rational Method\n        SCS Curve Number\n      Conceptual Models\n        Unit Hydrograph\n        Sacramento Model\n      Physically-based Models\n        Distributed Models\n        Finite Element\n      Integrated Models\n        SWAT\n        HEC-HMS\n        MIKE SHE\n        MODFLOW\n    <b>Measurement Techniques</b>\n      Rain Gauges\n        Tipping Bucket\n        Weighing\n      Stream Gauging\n        Rating Curves\n        Velocity-Area\n        Acoustic Doppler\n      Groundwater Monitoring\n        Piezometers\n        Water Level Recorders\n      Soil Moisture Sensors\n      Weather Stations\n      Remote Sensing\n        Satellite Precipitation\n        GRACE\n        Radar\n    <b>Applications</b>\n      Flood Forecasting\n      Water Supply Assessment\n      Drought Monitoring\n      Irrigation Planning\n      Hydropower Design\n      Contaminant Transport\n      Ecosystem Flows\n      Climate Impact Studies\n    <b>Specialized Fields</b>\n      Urban Hydrology\n      Ecohydrology\n      Isotope Hydrology\n      Cryosphere Hydrology",
            "complexity": "high",
            "tags": [
                "hydrology",
                "earth_sciences"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}