{
    "diagrams": [
        {
            "id": "302",
            "topic": "Climatology",
            "category": "Earth Sciences",
            "description": "Climatology encompasses diverse climate phenomena, data sources, and applications. Climate classification systems include Köppen-Geiger classification (tropical, dry, temperate, continental, polar), Thornthwaite classification (based on moisture and temperature), Trewartha modification, and bioclimatic zones. Climate controls feature latitude (solar radiation angle), altitude (temperature lapse rate), proximity to water bodies (maritime vs. continental), ocean currents (warm vs. cold), atmospheric circulation (Hadley, Ferrel, Polar cells), topography (rain shadow effects), and land surface characteristics. Climate data sources span weather station networks (temperature, precipitation, wind), upper-air observations (radiosondes, aircraft), satellite systems (geostationary and polar-orbiting), reanalysis datasets (ERA5, NCEP), and proxy data (ice cores, sediments, tree rings, corals, pollen). Climate variability modes include El Niño-Southern Oscillation (ENSO - El Niño and La Niña phases), Pacific Decadal Oscillation (PDO), North Atlantic Oscillation (NAO), Arctic Oscillation (AO), Indian Ocean Dipole (IOD), Madden-Julian Oscillation (MJO), and monsoon systems (Asian, African, American). Climate models range from energy balance models, radiative-convective models, general circulation models (GCMs/AOGCMs), regional climate models (RCMs), to Earth System Models (ESMs) incorporating carbon cycles and ice sheets. Climate indices include temperature anomalies, precipitation indices (SPI, PDSI for drought), teleconnection indices, extreme climate indices, and climate normals (30-year averages). Applications cover agriculture (growing seasons, crop suitability), water resources (precipitation patterns, drought planning), urban planning (heat island mitigation, climate-resilient design), energy (renewable energy potential, heating/cooling demand), health (disease vectors, heat stress), and disaster risk reduction. Emerging areas include climate services, urban climatology, climate attribution science, downscaling techniques, and climate informatics using big data and AI.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Climatology</b>))\n    <b>Climate Classification</b>\n      Köppen-Geiger\n        Tropical\n        Dry\n        Temperate\n        Continental\n        Polar\n      Thornthwaite\n      Trewartha Modification\n      Bioclimatic Zones\n    <b>Climate Controls</b>\n      Latitude\n      Altitude\n      Proximity to Water\n      Ocean Currents\n      Atmospheric Circulation\n        Hadley Cell\n        Ferrel Cell\n        Polar Cell\n      Topography\n      Land Surface\n    <b>Climate Data Sources</b>\n      Weather Station Networks\n        Temperature\n        Precipitation\n        Wind\n      Upper-air Observations\n        Radiosondes\n        Aircraft\n      Satellite Systems\n        Geostationary\n        Polar-orbiting\n      Reanalysis Datasets\n        ERA5\n        NCEP\n      Proxy Data\n        Ice Cores\n        Sediments\n        Tree Rings\n        Corals\n        Pollen\n    <b>Climate Variability Modes</b>\n      ENSO\n        El Niño\n        La Niña\n      Pacific Decadal Oscillation\n      North Atlantic Oscillation\n      Arctic Oscillation\n      Indian Ocean Dipole\n      Madden-Julian Oscillation\n      Monsoon Systems\n    <b>Climate Models</b>\n      Energy Balance Models\n      Radiative-Convective Models\n      General Circulation Models\n      Regional Climate Models\n      Earth System Models\n    <b>Climate Indices</b>\n      Temperature Anomalies\n      Precipitation Indices\n        SPI\n        PDSI\n      Teleconnection Indices\n      Extreme Climate Indices\n      Climate Normals\n    <b>Applications</b>\n      Agriculture\n        Growing Seasons\n        Crop Suitability\n      Water Resources\n      Urban Planning\n        Heat Island\n        Resilient Design\n      Energy\n        Renewable Potential\n        Demand\n      Health\n        Disease Vectors\n        Heat Stress\n      Disaster Risk Reduction\n    <b>Emerging Areas</b>\n      Climate Services\n      Urban Climatology\n      Climate Attribution\n      Downscaling Techniques\n      Climate Informatics",
            "complexity": "high",
            "tags": [
                "climatology",
                "earth_sciences"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}