{
    "diagrams": [
        {
            "id": "303",
            "topic": "Structural Geology",
            "category": "Earth Sciences",
            "description": "Structural Geology encompasses diverse deformation features, analysis methods, and applications. Brittle structures include faults (normal faults from extension, reverse and thrust faults from compression, strike-slip faults from shear), joints (systematic and non-systematic), fractures, breccias, and fault rocks (gouge, cataclasite, pseudotachylite). Ductile structures feature folds (anticlines, synclines, monoclines, recumbent folds, nappes), foliation (cleavage, schistosity, gneissic banding), lineation (mineral alignment, stretching lineation), shear zones (mylonites, ductile shear), and boudinage. Structural measurements involve strike and dip notation, trend and plunge for linear features, stereographic projections (equal-area, equal-angle), structural cross-sections, and geological maps. Tectonic regimes encompass compressional settings (mountain belts, fold-thrust belts, accretionary wedges), extensional settings (rift valleys, normal fault systems, metamorphic core complexes), strike-slip settings (transform faults, pull-apart basins), and inversion tectonics. Deformation mechanisms include brittle fracture at low temperatures and pressures, pressure solution and dissolution-precipitation, dislocation creep in crystals, diffusion creep, grain boundary sliding, and twinning. Analysis tools include field mapping with compass-clinometer, remote sensing and aerial photography, geophysical methods (seismic reflection, gravity, magnetics), laboratory deformation experiments, computer modeling (finite element analysis, discrete element modeling), and geochronology for timing deformation. Applications cover petroleum geology (structural traps, fault seal analysis, fracture permeability), mineral exploration (structural controls on ore deposits), earthquake geology (active faults, paleoseismology, seismic hazard), engineering geology (slope stability, tunnel design, foundation assessment), and tectonic reconstructions. Key concepts include Anderson's theory of faulting, Mohr-Coulomb failure criteria, fold classification schemes, balanced cross-sections, and strain ellipsoids.",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Structural<br>Geology</b>))\n    <b>Brittle Structures</b>\n      Faults\n        Normal Faults\n        Reverse & Thrust\n        Strike-slip\n      Joints\n        Systematic\n        Non-systematic\n      Fractures\n      Breccias\n      Fault Rocks\n        Gouge\n        Cataclasite\n        Pseudotachylite\n    <b>Ductile Structures</b>\n      Folds\n        Anticlines\n        Synclines\n        Monoclines\n        Recumbent\n        Nappes\n      Foliation\n        Cleavage\n        Schistosity\n        Gneissic Banding\n      Lineation\n        Mineral Alignment\n        Stretching\n      Shear Zones\n        Mylonites\n      Boudinage\n    <b>Structural Measurements</b>\n      Strike & Dip\n      Trend & Plunge\n      Stereographic Projections\n        Equal-area\n        Equal-angle\n      Cross-sections\n      Geological Maps\n    <b>Tectonic Regimes</b>\n      Compressional\n        Mountain Belts\n        Fold-Thrust Belts\n        Accretionary Wedges\n      Extensional\n        Rift Valleys\n        Normal Fault Systems\n        Core Complexes\n      Strike-slip\n        Transform Faults\n        Pull-apart Basins\n      Inversion Tectonics\n    <b>Deformation Mechanisms</b>\n      Brittle Fracture\n      Pressure Solution\n      Dislocation Creep\n      Diffusion Creep\n      Grain Boundary Sliding\n      Twinning\n    <b>Analysis Tools</b>\n      Field Mapping\n        Compass-Clinometer\n      Remote Sensing\n      Geophysical Methods\n        Seismic Reflection\n        Gravity\n        Magnetics\n      Laboratory Experiments\n      Computer Modeling\n        FEA\n        DEM\n      Geochronology\n    <b>Applications</b>\n      Petroleum Geology\n        Structural Traps\n        Fault Seal\n        Fracture Permeability\n      Mineral Exploration\n        Ore Controls\n      Earthquake Geology\n        Active Faults\n        Paleoseismology\n      Engineering Geology\n        Slope Stability\n        Tunnels\n      Tectonic Reconstruction\n    <b>Key Concepts</b>\n      Anderson's Theory\n      Mohr-Coulomb Criteria\n      Fold Classification\n      Balanced Cross-sections\n      Strain Ellipsoids",
            "complexity": "high",
            "tags": [
                "structural_geology",
                "earth_sciences"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}