{
    "diagrams": [
        {
            "id": "304",
            "topic": "Mineralogy",
            "category": "Earth Sciences",
            "description": "Mineralogy encompasses diverse mineral groups, properties, and analytical techniques. Crystal systems include cubic/isometric (highest symmetry), tetragonal, orthorhombic, monoclinic, triclinic (lowest symmetry), hexagonal, and trigonal/rhombohedral, each with characteristic symmetry elements. Major mineral classes feature silicates (most abundant - nesosilicates like olivine, inosilicates like pyroxenes and amphiboles, phyllosilicates like micas and clays, tectosilicates like feldspars and quartz), carbonates (calcite, dolomite, aragonite), oxides and hydroxides (hematite, magnetite, corundum, spinel, goethite), sulfides and sulfosalts (pyrite, galena, sphalerite, chalcopyrite), sulfates (gypsum, anhydrite, barite), halides (halite, fluorite), phosphates (apatite), and native elements (gold, silver, copper, sulfur, graphite, diamond). Physical properties for identification include Mohs hardness scale (1-10), cleavage (perfect, good, poor) and fracture types (conchoidal, uneven, splintery), luster (metallic, vitreous, pearly, silky), color and streak, specific gravity, crystal habit (prismatic, tabular, fibrous, massive), and special properties (magnetism, fluorescence, radioactivity, taste, effervescence with acid). Optical properties involve refractive index, birefringence, pleochroism, extinction angle, optic sign, and interference colors in thin sections. Analytical techniques encompass X-ray diffraction (XRD) for structure, electron microprobe analysis (EMPA) for composition, scanning electron microscopy (SEM) with energy-dispersive spectroscopy (EDS), Raman and infrared spectroscopy, X-ray fluorescence (XRF), inductively coupled plasma mass spectrometry (ICP-MS), and petrographic microscopy. Formation environments include igneous settings (magmatic crystallization, pegmatites), metamorphic environments (recrystallization, new mineral formation), hydrothermal systems (vein deposits, replacement), sedimentary processes (evaporites, chemical precipitation), and weathering zones (secondary minerals, oxidation). Applications span ore geology and mining (economic minerals, exploration), gemology (precious and semi-precious stones), environmental mineralogy (asbestos, heavy metal sequestration, acid mine drainage), industrial minerals (cement, ceramics, abrasives), soil mineralogy, and planetary mineralogy (meteorites, lunar samples, Mars minerals).",
            "diagram_type": "mindmap",
            "mermaid_code": "mindmap\n  root((<b>Mineralogy</b>))\n    <b>Crystal Systems</b>\n      Cubic/Isometric\n      Tetragonal\n      Orthorhombic\n      Monoclinic\n      Triclinic\n      Hexagonal\n      Trigonal/Rhombohedral\n    <b>Major Mineral Classes</b>\n      Silicates\n        Nesosilicates (Olivine)\n        Inosilicates (Pyroxenes, Amphiboles)\n        Phyllosilicates (Micas, Clays)\n        Tectosilicates (Feldspars, Quartz)\n      Carbonates\n        Calcite\n        Dolomite\n        Aragonite\n      Oxides & Hydroxides\n        Hematite\n        Magnetite\n        Corundum\n        Spinel\n        Goethite\n      Sulfides\n        Pyrite\n        Galena\n        Sphalerite\n        Chalcopyrite\n      Sulfates\n        Gypsum\n        Anhydrite\n        Barite\n      Halides\n        Halite\n        Fluorite\n      Phosphates\n        Apatite\n      Native Elements\n        Gold, Silver, Copper\n        Sulfur\n        Graphite, Diamond\n    <b>Physical Properties</b>\n      Mohs Hardness (1-10)\n      Cleavage & Fracture\n        Perfect, Good, Poor\n        Conchoidal, Uneven\n      Luster\n        Metallic, Vitreous\n        Pearly, Silky\n      Color & Streak\n      Specific Gravity\n      Crystal Habit\n        Prismatic\n        Tabular\n        Fibrous\n        Massive\n      Special Properties\n        Magnetism\n        Fluorescence\n        Radioactivity\n        Effervescence\n    <b>Optical Properties</b>\n      Refractive Index\n      Birefringence\n      Pleochroism\n      Extinction Angle\n      Optic Sign\n      Interference Colors\n    <b>Analytical Techniques</b>\n      X-ray Diffraction (XRD)\n      Electron Microprobe (EMPA)\n      SEM-EDS\n      Raman Spectroscopy\n      Infrared Spectroscopy\n      XRF\n      ICP-MS\n      Petrographic Microscopy\n    <b>Formation Environments</b>\n      Igneous\n        Magmatic Crystallization\n        Pegmatites\n      Metamorphic\n        Recrystallization\n        New Mineral Formation\n      Hydrothermal\n        Vein Deposits\n        Replacement\n      Sedimentary\n        Evaporites\n        Chemical Precipitation\n      Weathering\n        Secondary Minerals\n        Oxidation\n    <b>Applications</b>\n      Ore Geology & Mining\n      Gemology\n      Environmental Mineralogy\n        Asbestos\n        Heavy Metal Sequestration\n        Acid Mine Drainage\n      Industrial Minerals\n        Cement\n        Ceramics\n        Abrasives\n      Soil Mineralogy\n      Planetary Mineralogy\n        Meteorites\n        Lunar Samples\n        Mars Minerals",
            "complexity": "high",
            "tags": [
                "mineralogy",
                "earth_sciences"
            ],
            "creation_date": "2025-11-04"
        }
    ]
}